app/controllers/welcome_controller.rb

INSERT INTO `welcomes` (`created_at`, `email`, `updated_at`) VALUES ('2013-03-19 00:15:40', 'asdfa', '2013-03-19 00:15:40')
---
  def create

    @welcome = Welcome.new(params[:welcome])

    respond_to do |format|
      if @welcome.save